# Preprocessing data in Pandas

In [1]:
import pandas as pd

#### Read the data
Data comes from [Kaggle](https://www.kaggle.com/c/titanic/data).

In [3]:
data = pd.read_csv('titanic.csv', index_col='PassengerId')
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
data['Pclass'][:5]

PassengerId
1    3
2    1
3    3
4    1
5    3
Name: Pclass, dtype: int64

In [8]:
data['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

#### 1. Какое количество мужчин и женщин ехало на корабле? В качестве ответа приведите два числа через пробел.

In [9]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

#### 2. Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров. Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.

In [10]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [30]:
count_passengers = len(data)
print('Count passengers =', count_passengers)

count_survived = data['Survived'].value_counts()
print(count_survived)

percent_die = count_survived[0] * 100.0 / count_passengers
print('Percent not survived =', percent_die)

percent_survived = count_survived[1] * 100.0 / count_passengers
print('Percent survived =', percent_survived)

Count passengers = 891
0    549
1    342
Name: Survived, dtype: int64
Percent not survived = 61.6161616162
Percent survived = 38.3838383838

#### 3. Какую долю пассажиры первого класса составляли среди всех пассажиров? Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.

In [33]:
pclass_counts = data['Pclass'].value_counts()
pclass_counts

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [35]:
percent_first_class = pclass_counts[1] * 100.0 / count_passengers
percent_first_class

24.242424242424242

#### 4. Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров. В качестве ответа приведите два числа через пробел.

In [36]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [39]:
age_median = data['Age'].median()
print(age_median)

age_mean = data['Age'].mean()
print(age_mean)

28.0
29.69911764705882

#### 5. Коррелируют ли число братьев/сестер/супругов с числом родителей/детей? Посчитайте корреляцию Пирсона между признаками SibSp и Parch.

In [42]:
data['SibSp'].corr(data['Parch'])

0.41483769862015613

#### 6. Какое самое популярное женское имя на корабле? Извлеките из полного имени пассажира (колонка Name) его личное имя (First Name). Это задание — типичный пример того, с чем сталкивается специалист по анализу данных. Данные очень разнородные и шумные, но из них требуется извлечь необходимую информацию. Попробуйте вручную разобрать несколько значений столбца Name и выработать правило для извлечения имен, а также разделения их на женские и мужские.

In [53]:
def clean(name):
    name = name.split(',')[1][1:].split(' ')
    if ((name[0] == 'Miss.') | (name[0] == 'Ms') ):
        return name[1]

In [54]:
data['Name'].map(clean).value_counts().head()

Mary         9
Anna         9
Margaret     6
Elizabeth    5
Alice        4
Name: Name, dtype: int64